
"""
百钱百鸡：我国古代数学家张丘建在《算经》一书中提出的数学问题：

鸡翁一值钱五，鸡母一值钱三，鸡雏三值钱一。百钱买百鸡，问鸡翁、鸡母、鸡雏各几何？
"""
# 方法一：穷举法

# 穷举法
# 分析：公鸡最多买：20只，母鸡最多买：33只。设：公鸡x只，母鸡y只，小鸡z只
# 则 0 < x < 20, 0 < y < 33, z = 100-x-y

# for x in range(1, 20):
#     for y in range(1, 33):
#         z = 100 - x - y
#         if 5 * x + 3 * y + z / 3 == 100 and z % 3 == 0:
#             print(f'公鸡{x},母鸡{y},小鸡{z}')

# 方法二：
# 分析：公鸡最多买：20只，母鸡最多买：33只。设：公鸡x只，母鸡y只，小鸡z只

import re
for i in range(0, 20):
    for j in range(0, 33):
        for k in range(3, 98, 3):
            if i+j+k == 100 and 5*i + 3*j + k//3 == 100:
                print("公鸡:", i, "母鸡:", j, "小鸡:", k)
